; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v5 ?v11)
             (pred_6 ?v7 ?v8)
             (pred_12 ?v5 ?v8)
             (pred_2 ?v6 ?v5 )
	     (pred_9 ?v5)
             (pred_7 ?v1)
             (pred_5 ?v7)
             (pred_3 ?v8)
             (pred_10 ?v5)
             (pred_1 ?v7)
             (pred_8 ?v5)
             (pred_4 ))



(:action op_2
:parameters (?v12 ?v13 ?v3 ?v2)
:precondition (and (pred_7 ?v12) (pred_7 ?v13) (pred_5 ?v3) (pred_3 ?v2)
          (pred_11 ?v12 ?v13) (pred_6 ?v3 ?v2)
                   (pred_12 ?v13 ?v2) (pred_9 ?v12) 
                   (pred_10 ?v13) (pred_1 ?v3))
:effect (and  (pred_8 ?v13) (not (pred_10 ?v13))))


(:action op_4
:parameters (?v12 ?v4)
:precondition (and (pred_7 ?v12) (pred_7 ?v4)
               (pred_9 ?v12) (pred_11 ?v12 ?v4) (pred_8 ?v4))
:effect (and (pred_9 ?v4) (not (pred_9 ?v12))))

(:action op_5
:parameters (?v12 ?v3)
:precondition (and (pred_7 ?v12) (pred_5 ?v3) 
                  (pred_9 ?v12) (pred_2 ?v3 ?v12) (pred_4 ))
:effect (and (pred_1 ?v3)
   (not (pred_2 ?v3 ?v12)) (not (pred_4 ))))


(:action op_3
:parameters (?v12 ?v9 ?v10)
:precondition (and (pred_7 ?v12) (pred_5 ?v9) (pred_5 ?v10)
                  (pred_9 ?v12) (pred_1 ?v10) (pred_2 ?v9 ?v12))
:effect (and (pred_1 ?v9) (pred_2 ?v10 ?v12)
        (not (pred_1 ?v10)) (not (pred_2 ?v9 ?v12))))

(:action op_1
:parameters (?v12 ?v3)
:precondition (and (pred_7 ?v12) (pred_5 ?v3) 
                  (pred_9 ?v12) (pred_1 ?v3))
:effect (and (pred_4 ) (pred_2 ?v3 ?v12) (not (pred_1 ?v3)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_08 obj_05 obj_03 obj_01 obj_09 obj_19 obj_02 obj_10 obj_20 obj_11 obj_21 obj_04 obj_14 obj_07 obj_15 obj_18
    obj_12 obj_06
    obj_17 obj_13 obj_16
    )

    (:init
       (pred_4)

       (pred_7 obj_08)
       (pred_7 obj_05)
       (pred_7 obj_03)
       (pred_7 obj_01)
       (pred_7 obj_09)
       (pred_7 obj_19)
       (pred_7 obj_02)
       (pred_7 obj_10)
       (pred_7 obj_20)
       (pred_7 obj_11)
       (pred_7 obj_21)
       (pred_7 obj_04)
       (pred_7 obj_14)
       (pred_7 obj_07)
       (pred_7 obj_15)
       (pred_7 obj_18)
       (pred_3 obj_12)
       (pred_3 obj_06)
       (pred_5 obj_17)
       (pred_5 obj_13)
       (pred_5 obj_16)

       (pred_11 obj_08 obj_09)
       (pred_11 obj_08 obj_05)
       (pred_11 obj_05 obj_19)
       (pred_11 obj_05 obj_03)
       (pred_11 obj_05 obj_08)
       (pred_11 obj_03 obj_02)
       (pred_11 obj_03 obj_01)
       (pred_11 obj_03 obj_05)
       (pred_11 obj_01 obj_10)
       (pred_11 obj_01 obj_03)
       (pred_11 obj_09 obj_20)
       (pred_11 obj_09 obj_19)
       (pred_11 obj_09 obj_08)
       (pred_11 obj_19 obj_11)
       (pred_11 obj_19 obj_02)
       (pred_11 obj_19 obj_05)
       (pred_11 obj_19 obj_09)
       (pred_11 obj_02 obj_21)
       (pred_11 obj_02 obj_10)
       (pred_11 obj_02 obj_03)
       (pred_11 obj_02 obj_19)
       (pred_11 obj_10 obj_04)
       (pred_11 obj_10 obj_01)
       (pred_11 obj_10 obj_02)
       (pred_11 obj_20 obj_14)
       (pred_11 obj_20 obj_11)
       (pred_11 obj_20 obj_09)
       (pred_11 obj_11 obj_07)
       (pred_11 obj_11 obj_21)
       (pred_11 obj_11 obj_19)
       (pred_11 obj_11 obj_20)
       (pred_11 obj_21 obj_15)
       (pred_11 obj_21 obj_04)
       (pred_11 obj_21 obj_02)
       (pred_11 obj_21 obj_11)
       (pred_11 obj_04 obj_18)
       (pred_11 obj_04 obj_10)
       (pred_11 obj_04 obj_21)
       (pred_11 obj_14 obj_07)
       (pred_11 obj_14 obj_20)
       (pred_11 obj_07 obj_15)
       (pred_11 obj_07 obj_11)
       (pred_11 obj_07 obj_14)
       (pred_11 obj_15 obj_18)
       (pred_11 obj_15 obj_21)
       (pred_11 obj_15 obj_07)
       (pred_11 obj_18 obj_04)
       (pred_11 obj_18 obj_15)
       (pred_10 obj_18)
       (pred_10 obj_01)
       (pred_10 obj_11)
       (pred_12  obj_18 obj_12)
       (pred_12  obj_01 obj_06)
       (pred_12  obj_11 obj_12)
       (pred_8 obj_08)
       (pred_8 obj_05)
       (pred_8 obj_03)
       (pred_8 obj_09)
       (pred_8 obj_19)
       (pred_8 obj_02)
       (pred_8 obj_10)
       (pred_8 obj_20)
       (pred_8 obj_21)
       (pred_8 obj_04)
       (pred_8 obj_14)
       (pred_8 obj_07)
       (pred_8 obj_15)

       (pred_6  obj_17 obj_12)
       (pred_6  obj_13 obj_06)
       (pred_6  obj_16 obj_12)
       (pred_2 obj_17 obj_15)
       (pred_2 obj_13 obj_09)
       (pred_2 obj_16 obj_02)
       (pred_9 obj_08)
    )

    (:goal (and
       (pred_2 obj_13 obj_20)
       (pred_2 obj_16 obj_21)
    ))
(:constraints
  (always (not (pred_9 obj_19)))
)
)

; plan
1. (op_4 obj_08 obj_09)
   deleted: (pred_9 obj_08)
   added: (pred_9 obj_09)
   goals met: 0 of 2
2. (op_5 obj_09 obj_13)
   deleted: (pred_2 obj_13 obj_09) (pred_4)
   added: (pred_1 obj_13)
   goals met: 0 of 2
3. (op_4 obj_09 obj_20)
   deleted: (pred_9 obj_09)
   added: (pred_9 obj_20)
   goals met: 0 of 2
4. (op_1 obj_20 obj_13)
   deleted: (pred_1 obj_13)
   added: (pred_4) (pred_2 obj_13 obj_20)
   goals met: 1 of 2
5. (op_4 obj_20 obj_09)
   deleted: (pred_9 obj_20)
   added: (pred_9 obj_09)
   goals met: 1 of 2
6. (op_4 obj_09 obj_08)
   deleted: (pred_9 obj_09)
   added: (pred_9 obj_08)
   goals met: 1 of 2
7. (op_4 obj_08 obj_05)
   deleted: (pred_9 obj_08)
   added: (pred_9 obj_05)
   goals met: 1 of 2
8. (op_4 obj_05 obj_03)
   deleted: (pred_9 obj_05)
   added: (pred_9 obj_03)
   goals met: 1 of 2
9. (op_4 obj_03 obj_02)
   deleted: (pred_9 obj_03)
   added: (pred_9 obj_02)
   goals met: 1 of 2
10. (op_5 obj_02 obj_16)
   deleted: (pred_2 obj_16 obj_02) (pred_4)
   added: (pred_1 obj_16)
   goals met: 1 of 2
11. (op_4 obj_02 obj_21)
   deleted: (pred_9 obj_02)
   added: (pred_9 obj_21)
   goals met: 1 of 2
12. (op_1 obj_21 obj_16)
   deleted: (pred_1 obj_16)
   added: (pred_4) (pred_2 obj_16 obj_21)
   goals met: 2 of 2
